sglang-bench/results/llama8b_1k1k_tp1_sglang_ver2/concurrency=128/bench.log
/localhome/local-triv/sglang-env/lib/python3.12/site-packages/torch/cuda/__init__.py:61: FutureWarning: The pynvml package is deprecated. Please install nvidia-ml-py instead. If you did not install pynvml directly, please report this to the maintainers of the package that installed pynvml for you.
  import pynvml  # type: ignore[import]
benchmark_args=Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=30000, dataset_name='random', dataset_path='', model='meta-llama/Meta-Llama-3.1-8B-Instruct', tokenizer=None, num_prompts=384, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1000, random_output_len=1000, random_range_ratio=0.0, request_rate=inf, max_concurrency=128, output_file='/localhome/local-triv/sglang-bench/results/llama8b_1k1k_tp1_sglang_ver2/concurrency=128/bench_results.jsonl', output_details=True, disable_tqdm=False, disable_stream=False, return_logprob=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, lora_name=None, prompt_suffix='', pd_separated=False, flush_cache=True, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256)
Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=30000, dataset_name='random', dataset_path='', model='meta-llama/Meta-Llama-3.1-8B-Instruct', tokenizer=None, num_prompts=384, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1000, random_output_len=1000, random_range_ratio=0.0, request_rate=inf, max_concurrency=128, output_file='/localhome/local-triv/sglang-bench/results/llama8b_1k1k_tp1_sglang_ver2/concurrency=128/bench_results.jsonl', output_details=True, disable_tqdm=False, disable_stream=False, return_logprob=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, lora_name=None, prompt_suffix='', pd_separated=False, flush_cache=True, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256)

#Input tokens: 189983
#Output tokens: 202843
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...
100%|██████████| 384/384 [02:45<00:00,  2.32it/s]

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 128       
Successful requests:                     384       
Benchmark duration (s):                  165.67    
Total input tokens:                      189983    
Total generated tokens:                  202843    
Total generated tokens (retokenized):    202903    
Request throughput (req/s):              2.32      
Input token throughput (tok/s):          1146.73   
Output token throughput (tok/s):         1224.36   
Total token throughput (tok/s):          2371.09   
Concurrency:                             113.40    
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   48923.83  
Median E2E Latency (ms):                 48802.56  
---------------Time to First Token----------------
Mean TTFT (ms):                          1507.74   
Median TTFT (ms):                        370.49    
P99 TTFT (ms):                           7373.43   
---------------Inter-Token Latency----------------
Mean ITL (ms):                           89.93     
Median ITL (ms):                         75.75     
P95 ITL (ms):                            231.12    
P99 ITL (ms):                            385.34    
Max ITL (ms):                            7110.59   
==================================================